fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type><types>CatalogRef.Организации</types></type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type><types>CatalogRef.Контрагенты</types></type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type><types>CatalogRef.ДоговорыКонтрагентов</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаВремяВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers><dateFractions>DateTime</dateFractions></dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type><types>CatalogRef.Пользователи</types></type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type><types>String</types><stringQualifiers/></type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_Работа</name>
      <type><types>CatalogRef.Номенклатура</types></type>
    </attributes>
    <attributes>
      <name>ВКМ_Часы</name>
      <type><types>Number</types><numberQualifiers><precision>10</precision><scale>2</scale></numberQualifiers></type>
    </attributes>
    <attributes>
      <name>ВКМ_СтоимостьЧаса</name>
      <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <periodicity>Month</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ВКМ_НужноУведомлениеПослеЗаписи;
Перем ВКМ_ТекстУведомленияПослеЗаписи;

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	ВКМ_Специалист = Пользователи.ТекущийПользователь();
	Если НЕ ЗначениеЗаполнено(ВКМ_ДатаВремяВыполнения) Тогда
		ВКМ_ДатаВремяВыполнения = ТекущаяДата();
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ПроверитьАбонентскийДоговорИПериод(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ПересчитатьСумму();
	// ВКМ_Изменение_Начало
	ВКМ_ЗарегистрироватьУведомлениеПоСобытиюЗаписи();
	// ВКМ_Изменение_Конец

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Отказ Или НЕ ВКМ_НужноУведомлениеПослеЗаписи Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ОбслуживаниеКлиентов.ВКМ_ДобавитьУведомлениеВОчередь(
		Ссылка,
		Контрагент,
		ВКМ_ТекстУведомленияПослеЗаписи);

	ВКМ_НужноУведомлениеПослеЗаписи = Ложь;
	ВКМ_ТекстУведомленияПослеЗаписи = "";

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	ВКМ_ПроверитьАбонентскийДоговорИПериод(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;

	Часы = ВКМ_ВыполненныеРаботы.Итог("ВКМ_Часы");
	Сумма = ВКМ_ВыполненныеРаботы.Итог("ВКМ_Сумма");
	Если Часы = 0 И Сумма = 0 Тогда
		Возврат;
	КонецЕсли;

	ДвижениеКлиенту = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	ДвижениеКлиенту.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеКлиенту.Период = ВКМ_ДатаВремяВыполнения;
	ДвижениеКлиенту.ВКМ_Клиент = Контрагент;
	ДвижениеКлиенту.ВКМ_Договор = Договор;
	ДвижениеКлиенту.ВКМ_ЧасовКОплате = Часы;
	ДвижениеКлиенту.ВКМ_СуммаКОплате = Сумма;

	ПроцентСотрудника = ВКМ_ПроцентСотрудникаПоУсловиямОплаты(ВКМ_Специалист);
	Если ПроцентСотрудника = Неопределено Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Для специалиста не задано условие оплаты с процентом от работ на дату обслуживания.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДвижениеСотруднику = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	ДвижениеСотруднику.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижениеСотруднику.Период = ВКМ_ДатаВремяВыполнения;
	ДвижениеСотруднику.ВКМ_Сотрудник = ВКМ_Специалист;
	ДвижениеСотруднику.ВКМ_ЧасовКОплате = Часы;
	ДвижениеСотруднику.ВКМ_СуммаКОплате = Окр(Сумма * ПроцентСотрудника / 100, 2);

КонецПроцедуры

#КонецОбласти

#Область ВКМ_СлужебныеПроцедурыИФункции

Процедура ВКМ_ПроверитьАбонентскийДоговорИПериод(Отказ)

	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Для документа обслуживания клиента необходимо указать договор.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ВидАбонентскогоДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	Если Договор.ВидДоговора <> ВидАбонентскогоДоговора Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Выбранный договор не относится к абонентскому обслуживанию.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Договор.ВКМ_ДатаНачалаДействия)
		И ВКМ_ДатаВремяВыполнения < НачалоДня(Договор.ВКМ_ДатаНачалаДействия) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата обслуживания меньше даты начала действия договора.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Договор.ВКМ_ДатаОкончанияДействия)
		И ВКМ_ДатаВремяВыполнения > КонецДня(Договор.ВКМ_ДатаОкончанияДействия) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата обслуживания больше даты окончания действия договора.'"));
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ВКМ_ПересчитатьСумму()

	ВКМ_СуммаДокумента = ВКМ_ВыполненныеРаботы.Итог("ВКМ_Сумма");

КонецПроцедуры

Процедура ВКМ_ЗарегистрироватьУведомлениеПоСобытиюЗаписи()

	// ВКМ_Изменение_Начало
	ВКМ_НужноУведомлениеПослеЗаписи = Ложь;
	ВКМ_ТекстУведомленияПослеЗаписи = "";

	НовыйДокумент = ЭтоНовый();
	ИзмененоКлючевоеПоле = Ложь;
	Если НЕ НовыйДокумент И ЗначениеЗаполнено(Ссылка) Тогда
		Предыдущий = Ссылка.ПолучитьОбъект();
		ИзмененоКлючевоеПоле =
			Предыдущий.ВКМ_ДатаВремяВыполнения <> ВКМ_ДатаВремяВыполнения
			ИЛИ Предыдущий.ВКМ_Специалист <> ВКМ_Специалист;
	КонецЕсли;

	Если НЕ НовыйДокумент И НЕ ИзмененоКлючевоеПоле Тогда
		Возврат;
	КонецЕсли;

	ВКМ_ТекстУведомленияПослеЗаписи = ?(НовыйДокумент,
		СтрШаблон(НСтр("ru = 'Создано обслуживание клиента: %1 от %2, специалист: %3'"),
			Номер, Формат(ВКМ_ДатаВремяВыполнения, "ДЛФ=DT"), ВКМ_Специалист),
		СтрШаблон(НСтр("ru = 'Изменено обслуживание клиента: %1. Новые дата/время/специалист: %2, %3'"),
			Номер, Формат(ВКМ_ДатаВремяВыполнения, "ДЛФ=DT"), ВКМ_Специалист));
	ВКМ_НужноУведомлениеПослеЗаписи = Истина;
	// ВКМ_Изменение_Конец

КонецПроцедуры

Функция ВКМ_ПроцентСотрудникаПоУсловиямОплаты(Сотрудник)

	Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УсловияОплаты.ВКМ_ПроцентОтРабот КАК ВКМ_ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК УсловияОплаты
	|ГДЕ
	|	УсловияОплаты.ВКМ_Сотрудник = &Сотрудник
	|	И УсловияОплаты.Период <= &ДатаДокумента
	|УПОРЯДОЧИТЬ ПО
	|	УсловияОплаты.Период УБЫВ";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ДатаДокумента", ВКМ_ДатаВремяВыполнения);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВКМ_ПроцентОтРабот;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

#КонецОбласти

#КонецЕсли
